# for i in range(5):
#     print("I want to learn pygame.")
#     print("I want to learn django.")

# print("outside")


# for i in range(5):
#     print(i)
# print()
# for n in range(5):
#     print(n+1)
# print('__________________________________')
# for x in range(1, 6):
#     print(x)

# for i in range(2,11,2):
#     print(i, end=' ')
# print()
# for i in range(1,10,2):
#     print(i, end=' ')


# for i in range(10,0,-1):
#     print(i)1


# for number in [1, 100, 2, -1, 0]:
#     print("  ", number, end=' ')

# exercise1
'''
با کمک لاکپشت و حلقه فور شکل های زیر را رسم کنید:
مثلث
مربع
پنجضلعی
ششضلعی
'''

# exercise 2:
'''
با کمک حلقه فور برنامه ای بنویسید که پنج عدد از ورودی بگیرد و حاصل جمع اعداد زوج و نیز 
حاصل جمع اعدا فرد را جداگانه نمایش دهد

'''
# exercise 3:
'''
تعداد تکرار حلقه فور = 3
با کمک حلقه فور برنامه ای بنویسید که اسامی و سن و شماره کلاس
پنج دانش اموز را بگیرد و برای هر دانش آموز یک دیکشنری جداگانه ایجاد کنید و ای ناطلاعات را
در هر یک از دیکشنری ها ذخیره نمایید
هر یک از دیکشنری ها را در لیستی ذخیره نمایید
در پایان اطلاعات کل دانش آموزان ثبت نام شده را نمایش دهید
'''
